jetty840/Sailfish-MightyBoardFirmware/dist/boards.txt
##############################################################

ArduinoSlave.name=Extruder Controller v2.x

ArduinoSlave.upload.protocol=stk500
ArduinoSlave.upload.maximum_size=14336
ArduinoSlave.upload.speed=19200

ArduinoSlave.bootloader.low_fuses=0xff
ArduinoSlave.bootloader.high_fuses=0xdd
ArduinoSlave.bootloader.extended_fuses=0x00
ArduinoSlave.bootloader.path=ArduinoSlave
ArduinoSlave.bootloader.file=ArduinoSlave.hex
ArduinoSlave.bootloader.unlock_bits=0x3F
ArduinoSlave.bootloader.lock_bits=0x0F

ArduinoSlave.build.mcu=atmega168
ArduinoSlave.build.f_cpu=16000000L
ArduinoSlave.build.core=arduino


##############################################################

SanguinoMaster.name=RepRap Motherboard v1.x
SanguinoMaster.upload.protocol=stk500
SanguinoMaster.upload.maximum_size=63488
SanguinoMaster.upload.speed=38400

SanguinoMaster.bootloader.low_fuses=0xFF
SanguinoMaster.bootloader.high_fuses=0xDC
SanguinoMaster.bootloader.extended_fuses=0xFD
SanguinoMaster.bootloader.path=SanguinoMaster
SanguinoMaster.bootloader.file=SanguinoMaster.hex
SanguinoMaster.bootloader.unlock_bits=0x3F
SanguinoMaster.bootloader.lock_bits=0x0F

SanguinoMaster.build.mcu=atmega644p
SanguinoMaster.build.f_cpu=16000000L
SanguinoMaster.build.core=sanguino
SanguinoMaster.verbose=false

